{
    "id": "69754d0c-0521-4986-9763-c0df6594b6bf",
    "name": "nnunet_segthor",
    "title": "nnU-Net (thoracic OAR)",
    "summary": {
        "description": "nnU-Net's thoracic OAR segmentation model is an AI-based pipeline for the automated segmentation of the heart, the aorta, the esophagus and the trachea in CT scans (with and without contrast).",
        "inputs": [ {
            "label": "Input Image",
            "description": "The CT scan of a patient.",
            "format": "DICOM",
            "modality": "CT",
            "bodypartexamined": "Chest",
            "slicethickness": "2.5 mm",
            "non-contrast": true,
            "contrast": true
        } ],
        "outputs": [ {
            "type": "Segmentation",
            "classes": [
                "HEART",
                "LEFT_ATRIUM",
                "LEFT_VENTRICLE",
                "RIGHT_ATRIUM",
                "RIGHT_VENTRICLE",
                "CORONARY_ARTERY_LAD",
                "CORONARY_ARTERY_CFLX",
                "CORONARY_ARTERY_RIGHT"
            ]
        } ],
        "model": {
            "architecture":  "U-net",
            "training": "supervised",
            "cmpapproach": "ensemble"
        },
        "data": {
            "training": {
                "vol_samples": 40
            },
            "evaluation": {
                "vol_samples": 20
            },
            "public": true,
            "external": false
        }
    },
    "details": {
        "name": "nnU-Net Thoracic Organs at Risk Segmentation Model",
        "version": "1.0.0",
        "devteam": "MIC-DKFZ (Helmholtz Imaging Applied Computer Vision Lab)",
        "type": "nnU-Net (U-Net structure, optimized by data-driven heuristics)",
        "date": {
            "weights": "01/02/22",
            "code": "n/a",
            "pub": "2020"
        },
        "cite": "Isensee, F., Jaeger, P. F., Kohl, S. A., Petersen, J., & Maier-Hein, K. H. (2020). nnU-Net: a self-configuring method for deep learning-based biomedical image segmentation. Nature Methods, 1-9.",        
        "license": {
            "code": "Apache 2.0",
            "weights": "CC BY-NC 4.0"
        },
        "publications": [
            {
                "title": "nnU-Net: a self-configuring method for deep learning-based biomedical image segmentation",
                "uri": "https://www.nature.com/articles/s41592-020-01008-z"
            }
        ],
        "github": "https://github.com/MIC-DKFZ/nnUNet/tree/nnunetv1",
        "zenodo": "https://zenodo.org/record/4485926"
    },
    "info": {
        "use": {
            "title": "Intended Use",
            "text": "This model is intended to perform esophagus, heart, trachea and aorta segmentation in contrast-enhanced (CE) and non-CE chest CT scans. The model has been trained and tested on patients with Non-Small Cell Lung Cancer (NSCLC) referred for curative-intent radiotherapy, so it might not be suited for a healthy population. The generalization capabilities of the model on a range of ages, genders, and ethnicities are unknown. The slice thickness should not exceed 2.5mm for best results."
        },
        "analyses": {
            "title": "Quantitative Analyses",
            "text": "The model's performance was assessed using the Dice Coefficient and the (raw) Hausdorff Distance, in the context of the CodaLab SegTHOR challenge. The complete breakdown of the metrics can be consulted on CodaLab [1] and is reported in the supplementary material to the publication [2].",
            "references": [
                {
                    "label": "SegTHOR Challenge on CodaLab",
                    "uri": "https://competitions.codalab.org/competitions/21145"
                },
                {
                    "label": "nnU-Net: a self-configuring method for deep learning-based biomedical image segmentation",
                    "uri": "https://www.nature.com/articles/s41592-020-01008-z"
                }
            ]
        },
        "evaluation": {
            "title": "Evaluation Data",
            "text": "The evaluation dataset consists of 20 contrast-enhanced (CE) and non-CE chest CT scans from the SegTHOR dataset [1][2]. This dataset comprised Non-Small Cell Lung Cancer (NSCLC) patients referred for curative-intent radiotherapy (excluding patients with tumor extension distorting the mediastinum anatomy). Images were provided by the Centre Henri Becquerel, Rouen, France (CHB). On each CT scan, the OARs have been delineated by an experienced radiation oncologist using a Varian Medical Systems SomaVision platform. The body and lung contours were segmented with the automatic tools available on the platform. The esophagus was manually delineated from the 4th cervical vertebra to the esophago-gastric junction. The heart was delineated as recommended by the Radiation Therapy Oncology Group 2. The trachea was contoured from the lower limit of the larynx to 2cm below the carena excluding the lobar bronchi. The aorta was delineated from its origin above the heart down to below the diaphragm pillars.",
            "references": [
                {
                    "label": "SegTHOR: Segmentation of Thoracic Organs at Risk in CT images",
                    "uri": "https://arxiv.org/abs/1912.05950"
                },
                {
                    "label": "SegTHOR Challenge on CodaLab",
                    "uri": "https://competitions.codalab.org/competitions/21145"
                }
            ]
        },
        "training": {
        "title": "Training Data",
        "text": "The evaluation dataset consists of 20 contrast-enhanced (CE) and non-CE chest CT scans from the SegTHOR dataset [1][2]. This dataset comprised Non-Small Cell Lung Cancer (NSCLC) patients referred for curative-intent radiotherapy (excluding patients with tumor extension distorting the mediastinum anatomy), provided by the Centre Henri Becquerel, Rouen, France (CHB). For details regarding the labels the model was trained with, see the section above. The authors reported the following reconstruction and acquisition parameters for the CT scans in the training datasets:",
        "tables": [
            {
                "label": "SegTHOR dataset",
                "entries": {
                    "Slice Thickness": "2-3.7 mm",
                    "In-Plane Resolution": "0.9–1.37 mm"
                }
            }
        ],
        "references": [
            {
                "label": "SegTHOR: Segmentation of Thoracic Organs at Risk in CT images",
                "uri": "https://arxiv.org/abs/1912.05950"
            },
            {
                "label": "SegTHOR Challenge on CodaLab",
                "uri": "https://competitions.codalab.org/competitions/21145"
            }
        ]
        }
    }
  }